[GG2Game.GG2HudUIShopActor]
OPEN_GOODS_RANK_ADD_STATUS=2
OPEN_GOODS_RANK_SUB_STATUS=2
OPEN_GOODS_RANK_SUKE_SUKE=6
TOP_BOTTOM_DISTANCE=3
TOUCH_FAILED_RELEASE_LENGTH=20
MAX_GOODS_TYPE=52
MAX_GOODS_BUTTON=23
DEFAULT_BACK_TALK_TIME=4.000000
MOVE_CASH_SPEED=50
STATUS_END_WAIT_TIME=1.000000
LEAVE_ALONE_REACTION_TIME=10.000000
STATUS_MOVE_SPEED=2.0
LD_GoodsData=(goodsName[0]="紅色能量飲料 LV1",goodsName[1]="赤の栄養ドリンクLV1",Price=800,effectType=1,Lv=1,MaxLv=5,OpenRank=0)
LD_GoodsData=(goodsName[0]="紅色能量飲料 LV2",goodsName[1]="赤の栄養ドリンクLV2",Price=1400,effectType=1,Lv=2,MaxLv=5,OpenRank=0)
LD_GoodsData=(goodsName[0]="紅色能量飲料 LV3",goodsName[1]="赤の栄養ドリンクLV3",Price=2000,effectType=1,Lv=3,MaxLv=5,OpenRank=3)
LD_GoodsData=(goodsName[0]="紅色能量飲料 LV4",goodsName[1]="赤の栄養ドリンクLV4",Price=2600,effectType=1,Lv=4,MaxLv=5,OpenRank=4)
LD_GoodsData=(goodsName[0]="紅色能量飲料 LV5",goodsName[1]="赤の栄養ドリンクLV5",Price=3200,effectType=1,Lv=5,MaxLv=5,OpenRank=5)
LD_GoodsData=(goodsName[0]="藍色能量飲料 LV1",goodsName[1]="青の栄養ドリンクLV1",Price=800,effectType=2,Lv=1,MaxLv=5,OpenRank=0)
LD_GoodsData=(goodsName[0]="藍色能量飲料 LV2",goodsName[1]="青の栄養ドリンクLV2",Price=1400,effectType=2,Lv=2,MaxLv=5,OpenRank=0)
LD_GoodsData=(goodsName[0]="藍色能量飲料 LV3",goodsName[1]="青の栄養ドリンクLV3",Price=2000,effectType=2,Lv=3,MaxLv=5,OpenRank=3)
LD_GoodsData=(goodsName[0]="藍色能量飲料 LV4",goodsName[1]="青の栄養ドリンクLV4",Price=2600,effectType=2,Lv=4,MaxLv=5,OpenRank=4)
LD_GoodsData=(goodsName[0]="藍色能量飲料 LV5",goodsName[1]="青の栄養ドリンクLV5",Price=3200,effectType=2,Lv=5,MaxLv=5,OpenRank=5)
LD_GoodsData=(goodsName[0]="綠色能量飲料 LV1",goodsName[1]="緑の栄養ドリンクLV1",Price=1000,effectType=3,Lv=1,MaxLv=3,OpenRank=0)
LD_GoodsData=(goodsName[0]="綠色能量飲料 LV2",goodsName[1]="緑の栄養ドリンクLV2",Price=2000,effectType=3,Lv=2,MaxLv=3,OpenRank=3)
LD_GoodsData=(goodsName[0]="綠色能量飲料 LV3",goodsName[1]="緑の栄養ドリンクLV3",Price=3000,effectType=3,Lv=3,MaxLv=3,OpenRank=5)
LD_GoodsData=(goodsName[0]="心跳攝像機 2",goodsName[1]="ドキドキカメラ２",Price=2000,effectType=4,Lv=1,MaxLv=2,OpenRank=0)
LD_GoodsData=(goodsName[0]="心跳攝像機 3",goodsName[1]="ドキドキカメラ３",Price=2500,effectType=4,Lv=2,MaxLv=2,OpenRank=0)
LD_GoodsData=(goodsName[0]="天使護襠",goodsName[1]="天使の股間プロテクター",Price=2000,effectType=5,Lv=1,MaxLv=1,OpenRank=0)
LD_GoodsData=(goodsName[0]="天使之油",goodsName[1]="天使のオイル",Price=2000,effectType=6,Lv=1,MaxLv=1,OpenRank=0)
LD_GoodsData=(goodsName[0]="天使耳塞",goodsName[1]="天使の耳せん",Price=2000,effectType=7,Lv=1,MaxLv=1,OpenRank=0)
LD_GoodsData=(goodsName[0]="天使眼藥水",goodsName[1]="天使の目薬",Price=5000,effectType=8,Lv=1,MaxLv=1,OpenRank=6)
LD_GoodsData=(goodsName[0]="測量捲尺",goodsName[1]="サイズチェッカー",Price=2000,effectType=9,Lv=1,MaxLv=1,OpenRank=0)
LD_GoodsData=(goodsName[0]="命運箭頭護符",goodsName[1]="運命の弓矢",Price=1500,effectType=10,Lv=1,MaxLv=1,OpenRank=0)
LD_GoodsData=(goodsName[0]="旋轉眼鏡",goodsName[1]="ガリ勉めがね",Price=600,effectType=11,Lv=1,MaxLv=1,OpenRank=2)
LD_GoodsData=(goodsName[0]="鐵啞鈴",goodsName[1]="鉄アレイ",Price=600,effectType=12,Lv=1,MaxLv=1,OpenRank=2)
LD_GoodsData=(goodsName[0]="時尚雜誌",goodsName[1]="おしゃれ雑誌",Price=600,effectType=13,Lv=1,MaxLv=1,OpenRank=2)
LD_GoodsData=(goodsName[0]="哦，我的學長",goodsName[1]="エッチな本",Price=600,effectType=14,Lv=1,MaxLv=1,OpenRank=2)
LD_GoodsData=(goodsName[0]="惡魔眼鏡",goodsName[1]="悪魔のめがね",Price=600,effectType=15,Lv=1,MaxLv=1,OpenRank=2)
LD_GoodsData=(goodsName[0]="惡魔啞鈴",goodsName[1]="悪魔の鉄アレイ",Price=600,effectType=16,Lv=1,MaxLv=1,OpenRank=2)
LD_GoodsData=(goodsName[0]="糟糕時尚雜誌",goodsName[1]="悪魔のおしゃれ雑誌",Price=600,effectType=17,Lv=1,MaxLv=1,OpenRank=2)
LD_GoodsData=(goodsName[0]="聖潔讀本",goodsName[1]="神聖なる書物",Price=600,effectType=18,Lv=1,MaxLv=1,OpenRank=2)
LD_GoodsData=(goodsName[0]="爲LOVEHEARTS捐款",goodsName[1]="LOVEHEARTS募金",Price=100,effectType=19,Lv=1,MaxLv=5,OpenRank=0)
LD_GoodsData=(goodsName[0]="爲LOVEHEARTS捐款",goodsName[1]="LOVEHEARTS募金",Price=500,effectType=19,Lv=2,MaxLv=5,OpenRank=0)
LD_GoodsData=(goodsName[0]="爲LOVEHEARTS捐款",goodsName[1]="LOVEHEARTS募金",Price=1000,effectType=19,Lv=3,MaxLv=5,OpenRank=0)
LD_GoodsData=(goodsName[0]="爲LOVEHEARTS捐款",goodsName[1]="LOVEHEARTS募金",Price=5000,effectType=19,Lv=4,MaxLv=5,OpenRank=0)
LD_GoodsData=(goodsName[0]="爲LOVEHEARTS捐款",goodsName[1]="LOVEHEARTS募金",Price=9999,effectType=19,Lv=5,MaxLv=5,OpenRank=0)
LD_GoodsData=(goodsName[0]="未使用道具框",goodsName[1]="未使用アイテム枠",Price=0,effectType=20,Lv=1,MaxLv=0,OpenRank=0)
LD_GoodsData=(goodsName[0]="信息素 Z",goodsName[1]="フェロモンＺ",Price=8000,effectType=21,Lv=1,MaxLv=1,OpenRank=0)
LD_GoodsData=(goodsName[0]="天使砧板",goodsName[1]="天使のまな板",Price=1500,effectType=22,Lv=1,MaxLv=1,OpenRank=0)
LD_GoodsData=(goodsName[0]="惡魔肉包",goodsName[1]="悪魔の肉まん",Price=1500,effectType=23,Lv=1,MaxLv=1,OpenRank=0)
